# Challenge

Another approach to identifying fraudulent transactions is to look for outliers in the data. Standard deviation or quartiles are often used to detect outliers. Using this starter notebook, code two Python functions:

* One that uses standard deviation to identify anomalies for any cardholder.

* Another that uses interquartile range to identify anomalies for any cardholder.

## Identifying Outliers using Standard Deviation

In [1]:
# Initial imports
import pandas as pd
import numpy as np
import random
from sqlalchemy import create_engine

In [2]:
# Create a connection to the database
engine = create_engine("postgresql://postgres:postgres@localhost:5432/fraud_db")

In [3]:
# load data from database for cardholders
query = """
        SELECT c.cardholder_id as cardholder_id, t.date, t.amount
        FROM credit_card as c
        INNER JOIN transaction as t on c.card=t.card;
        """

# Creating Dataframe from data
data_df = pd.read_sql(query,engine)
display(data_df.head())
display(data_df.tail())

   cardholder_id                date  amount
0             13 2018-01-01 21:35:10    6.22
1             13 2018-01-01 21:43:12    3.83
2             10 2018-01-01 22:41:21    9.61
3              4 2018-01-01 23:13:30   19.03
4             18 2018-01-01 23:15:10    2.95

      cardholder_id                date  amount
3495             15 2018-12-31 01:24:15    4.84
3496             10 2018-12-31 03:33:28    3.26
3497             19 2018-12-31 05:53:58   10.73
3498             23 2018-12-31 08:22:17   11.87
3499             15 2018-12-31 09:50:25   19.75

In [39]:
# Write function that locates outliers using standard deviation
def outlier(data_df):
    mean = data_df['amount'].mean()
    std = data_df['amount'].std()
    data_df = data_df.loc[(data_df['amount'] > mean+std*2)  | (data_df['amount'] < mean-std*2)]
    return data_df

In [40]:
# Find anomalous transactions for 3 random card holders
id, id_1, id_2 = random.choices(data_df['cardholder_id'], k=3) 

# Call  each Cardholder ID using the outlier function
data_df_1 = outlier(data_df.loc[data_df['cardholder_id'] == id])
data_df_2 = outlier(data_df.loc[data_df['cardholder_id'] == id_1])
data_df_3= outlier(data_df.loc[data_df['cardholder_id'] == id_2])

In [41]:
# Combine the 3 random cardholders and display the dataframe
rand_3 = pd.concat([data_df_1, data_df_2, data_df_3], axis=0, join='inner')
rand_3

      cardholder_id                date   amount
62                6 2018-01-08 02:34:32  1029.00
563               6 2018-02-27 15:27:32  1145.00
1109              6 2018-04-21 19:41:51  2108.00
1796              6 2018-07-03 14:56:36  1398.00
2017              6 2018-07-24 22:42:00  1108.00
2117              6 2018-08-05 01:06:38  1379.00
2360              6 2018-09-02 06:17:00  2001.00
2432              6 2018-09-11 15:16:47  1856.00
3190              6 2018-11-27 17:20:29  1279.00
121              20 2018-01-14 06:19:11    21.11
1287             20 2018-05-11 12:43:50    20.56
2297             20 2018-08-26 07:15:18    23.13
2694             20 2018-10-07 08:16:54    20.44
3024             20 2018-11-09 19:38:36    20.27
487              18 2018-02-19 22:48:25  1839.00
925              18 2018-04-03 03:23:37  1077.00
1508             18 2018-06-03 20:02:28  1814.00
1956             18 2018-07-18 09:19:08   974.00
2425             18 2018-09-10 22:49:41  1176.00
3095             18 2018-11-17 05:30:43  1769.00
3324             18 2018-12-13 12:09:58  1154.00

## Identifying Outliers Using Interquartile Range

In [42]:
# Write a function that locates outliers using interquartile range
def interq(data_df):
    q1 = data_df['amount'].quantile(0.25) #first quartile
    q3 = data_df['amount'].quantile(0.75) #third quartile#
    iqr= q3 - q1
    break_off = iqr * 1.5 #calculate outlier cutoff
    lower_bound = q1 - (break_off)
    upper_bound = q3 + (break_off)
    data_df = data_df.loc[(data_df['amount'] > upper_bound) | (data_df['amount'] < lower_bound)]
    return data_df

In [43]:
# Find anomalous transactions for 3 random card holders
# making use of previous random numbers
data_df_4 = interq(data_df.loc[data_df['cardholder_id'] == id])
data_df_5 = interq(data_df.loc[data_df['cardholder_id'] == id_1])
data_df_6 = interq(data_df.loc[data_df['cardholder_id'] == id_2])

In [44]:
# Concat dataframe and display results
rand_3q = pd.concat([data_df_1, data_df_2, data_df_3], axis=0, join='inner')
rand_3q

      cardholder_id                date   amount
62                6 2018-01-08 02:34:32  1029.00
563               6 2018-02-27 15:27:32  1145.00
1109              6 2018-04-21 19:41:51  2108.00
1796              6 2018-07-03 14:56:36  1398.00
2017              6 2018-07-24 22:42:00  1108.00
2117              6 2018-08-05 01:06:38  1379.00
2360              6 2018-09-02 06:17:00  2001.00
2432              6 2018-09-11 15:16:47  1856.00
3190              6 2018-11-27 17:20:29  1279.00
121              20 2018-01-14 06:19:11    21.11
1287             20 2018-05-11 12:43:50    20.56
2297             20 2018-08-26 07:15:18    23.13
2694             20 2018-10-07 08:16:54    20.44
3024             20 2018-11-09 19:38:36    20.27
487              18 2018-02-19 22:48:25  1839.00
925              18 2018-04-03 03:23:37  1077.00
1508             18 2018-06-03 20:02:28  1814.00
1956             18 2018-07-18 09:19:08   974.00
2425             18 2018-09-10 22:49:41  1176.00
3095             18 2018-11-17 05:30:43  1769.00
3324             18 2018-12-13 12:09:58  1154.00

In [30]:
# What happens when we remove outliers?
def interqt(data_df):
    q1 = data_df['amount'].quantile(0.25) #first quartile
    q3 = data_df['amount'].quantile(0.75) #third quartile#
    iqr= q3 - q1
    break_off = iqr * 1.5 #calculate outlier cutoff
    lower_quart = q1 - break_off
    upper_quart = q3 - break_off
    data_df = data_df.loc[(data_df['amount'] <= lower_quart) | (data_df['amount'] >= upper_quart)]
    return data_df

In [45]:
rand_3q = pd.concat([data_df_1, data_df_2, data_df_3], axis=0, join='inner')
rand_3q

      cardholder_id                date   amount
62                6 2018-01-08 02:34:32  1029.00
563               6 2018-02-27 15:27:32  1145.00
1109              6 2018-04-21 19:41:51  2108.00
1796              6 2018-07-03 14:56:36  1398.00
2017              6 2018-07-24 22:42:00  1108.00
2117              6 2018-08-05 01:06:38  1379.00
2360              6 2018-09-02 06:17:00  2001.00
2432              6 2018-09-11 15:16:47  1856.00
3190              6 2018-11-27 17:20:29  1279.00
121              20 2018-01-14 06:19:11    21.11
1287             20 2018-05-11 12:43:50    20.56
2297             20 2018-08-26 07:15:18    23.13
2694             20 2018-10-07 08:16:54    20.44
3024             20 2018-11-09 19:38:36    20.27
487              18 2018-02-19 22:48:25  1839.00
925              18 2018-04-03 03:23:37  1077.00
1508             18 2018-06-03 20:02:28  1814.00
1956             18 2018-07-18 09:19:08   974.00
2425             18 2018-09-10 22:49:41  1176.00
3095             18 2018-11-17 05:30:43  1769.00
3324             18 2018-12-13 12:09:58  1154.00